elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
    return count;
}


void IRAM_ATTR onTimer() {
  xSemaphoreGiveFromISR(timerSemaphore, NULL);
}


#ifdef PLAY_LAST_RFID_AFTER_REBOOT
    // Store last RFID-tag to NVS
    void storeLastRfidPlayed(char *_rfid) {
        prefsSettings.putString("lastRfid", (String) _rfid);
    }

    // Get last RFID-tag applied from NVS
    void recoverLastRfidPlayed(void) {
        if (recoverLastRfid) {
            recoverLastRfid = false;
            String lastRfidPlayed = prefsSettings.getString("lastRfid", "-1");
            if (!lastRfidPlayed.compareTo("-1")) {
                loggerNl(serialDebug,((char *) FPSTR(unableToRestoreLastRfidFromNVS), LOGLEVEL_INFO);
            } else {
                char *lastRfid = strdup(lastRfidPlayed.c_str());
                xQueueSend(rfidCardQueue, &lastRfid, 0);
                snprintf(logBuf, serialLoglength, "%s: %s", (char *) FPSTR(restoredLastRfidFromNVS), lastRfidPlayed.c_str());
                loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
            }
        }
    }
#endif


#ifdef MEASURE_BATTERY_VOLTAGE
    // The average of several analog reads will be taken to reduce the noise (Note: One analog read takes ~10µs)
    float measureBatteryVoltage(void) {
        float factor = 1 / ((float) rdiv2/(rdiv2+rdiv1));
        float averagedAnalogValue = 0;
        uint8_t i;
        for (i=0; i<=19; i++) {
            averagedAnalogValue += (float)analogRead(VOLTAGE_READ_PIN);
        }
        averagedAnalogValue /= 20.0;
        return (averagedAnalogValue / maxAnalogValue) * referenceVoltage * factor + offsetVoltage;
    }

    // Measureas voltage of a battery as per interval or after bootup (after allowing a few seconds to settle down)
    void batteryVoltageTester(void) {
        if ((millis() - lastVoltageCheckTimestamp >= voltageCheckInterval*60000) || (!lastVoltageCheckTimestamp && millis()>=10000)) {
            float voltage = measureBatteryVoltage();
            #ifdef NEOPIXEL_ENABLE
                if (voltage <= warningLowVoltage) {
                    snprintf(logBuf, serialLoglength, "%s: (%.2f V)", (char *) FPSTR(voltageTooLow), voltage);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
                    showVoltageWarning = true;
                }
            #endif

            #ifdef MQTT_ENABLE
                char vstr[6];
                snprintf(vstr, 6, "%.2f", voltage);
                publishMqtt((char *) FPSTR(topicBatteryVoltage), vstr, false);
            #endif
            snprintf(logBuf, serialLoglength, "%s: %.2f V", (char *) FPSTR(currentVoltageMsg), voltage);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
            lastVoltageCheckTimestamp = millis();
        }
    }
#endif


// If timer-semaphore is set, read buttons (unless controls are locked)
void buttonHandler() {
    if (xSemaphoreTake(timerSemaphore, 0) == pdTRUE) {
        if (lockControls) {
            return;
        }
        unsigned long currentTimestamp = millis();
        buttons[0].currentState = digitalRead(NEXT_BUTTON);
        buttons[1].currentState = digitalRead(PREVIOUS_BUTTON);
        buttons[2].currentState = digitalRead(PAUSEPLAY_BUTTON);
        #ifdef USE_ENCODER
            buttons[3].currentState = digitalRead(DREHENCODER_BUTTON);
        #endif

        // Iterate over all buttons in struct-array
        for (uint8_t i=0; i < sizeof(buttons) / sizeof(buttons[0]); i++) {
            if (buttons[i].currentState != buttons[i].lastState && currentTimestamp - buttons[i].lastPressedTimestamp > buttonDebounceInterval) {
                if (!buttons[i].currentState) {
                    buttons[i].isPressed = true;
                    buttons[i].lastPressedTimestamp = currentTimestamp;
                } else {
                    buttons[i].isReleased = true;
                    buttons[i].lastReleasedTimestamp = currentTimestamp;
                }
            }
            buttons[i].lastState = buttons[i].currentState;
        }
    }
}


// Do corresponding actions for all buttons
void doButtonActions(void) {
    if (lockControls) {
        return; // Avoid button-handling if buttons are locked
    }

    // WiFi-toggle
    if (buttons[0].isPressed && buttons[1].isPressed) {
        if (!wifiStatusToggledTimestamp || (millis() - wifiStatusToggledTimestamp >= 2000)) {
            wifiStatusToggledTimestamp = millis();
            buttons[0].isPressed = false;
            buttons[1].isPressed = false;
            if (operating_mode == ESPUINO_MODE)
            {
                if (prefsSettings.putUChar("operating_mode", BT_MODE)) {
                    loggerNl(serialDebug, (char *) FPSTR("BT_MODE"), LOGLEVEL_DEBUG);
                    delay(1000);
                    ESP.restart();
                }
            }
            
            if (operating_mode == BT_MODE)
            {
                if (prefsSettings.putUChar("operating_mode", WEBRADIO_MODE)) {
                    loggerNl(serialDebug, (char *) FPSTR("WEBRADIO_MODE"), LOGLEVEL_DEBUG);
                    delay(1000);
                    ESP.restart();
                }
            }

            if (operating_mode == WEBRADIO_MODE)
            {
                if (prefsSettings.putUChar("operating_mode", ESPUINO_MODE))
                {
                  loggerNl(serialDebug, (char *) FPSTR("ESPUINO_MODE"), LOGLEVEL_DEBUG);
                  delay(1000);
                  ESP.restart();
                }
            }
        }
        return;
    }

    // FTP-enable
    #ifdef FTP_ENABLE
        if (!ftpEnableLastStatus && !ftpEnableCurrentStatus) {
            if (buttons[0].isPressed && buttons[2].isPressed) {
                buttons[0].isPressed = false;
                buttons[2].isPressed = false;
                ftpEnableLastStatus = true;
                #ifdef NEOPIXEL_ENABLE
                    showLedOk = true;
                #endif
            return;
           }
        }
    #endif

    for (uint8_t i=0; i < sizeof(buttons) / sizeof(buttons[0]); i++) {
        if (buttons[i].isPressed) {
            if (buttons[i].lastReleasedTimestamp > buttons[i].lastPressedTimestamp) {
                if (buttons[i].lastReleasedTimestamp - buttons[i].lastPressedTimestamp >= intervalToLongPress) {
                    switch (i)      // Long-press-actions
                    {
                    case 0:
                        trackControlToQueueSender(NEXTTRACK);
                        buttons[i].isPressed = false;
                        break;

                    case 1:
                        trackControlToQueueSender(PREVIOUSTRACK);
                        buttons[i].isPressed = false;
                        break;

