elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
    for (;;) {
        esp_task_wdt_reset();
        vTaskDelay(10);
        if ((millis() - lastRfidCheckTimestamp) >= RFID_SCAN_INTERVAL) {
            lastRfidCheckTimestamp = millis();
            // Reset the loop if no new card is present on the sensor/reader. This saves the entire process when idle.

            if (!mfrc522->PICC_IsNewCardPresent()) {
                continue;
            }

            // Select one of the cards
            if (!mfrc522->PICC_ReadCardSerial()) {
                continue;
            }

            //mfrc522.PICC_DumpToSerial(&(mfrc522.uid));
            //mfrc522.PICC_HaltA();
            //mfrc522.PCD_StopCrypto1();

            cardIdString = (char *) malloc(cardIdSize*3 +1);
            if (cardIdString == NULL) {
                logger(serialDebug, (char *) FPSTR(unableToAllocateMem), LOGLEVEL_ERROR);
                #ifdef NEOPIXEL_ENABLE
                    showLedError = true;
                #endif
                continue;
            }

            uint8_t n = 0;
            logger(serialDebug, (char *) FPSTR(rfidTagDetected), LOGLEVEL_NOTICE);
            for (uint8_t i=0; i<cardIdSize; i++) {
                cardId[i] = mfrc522->uid.uidByte[i];

                snprintf(logBuf, serialLoglength, "%02x", cardId[i]);
                logger(serialDebug, logBuf, LOGLEVEL_NOTICE);

                n += snprintf (&cardIdString[n], sizeof(cardIdString) / sizeof(cardIdString[0]), "%03d", cardId[i]);
                if (i<(cardIdSize-1)) {
                    logger(serialDebug, "-", LOGLEVEL_NOTICE);
                } else {
                    logger(serialDebug, "\n", LOGLEVEL_NOTICE);
                }
            }
            xQueueSend(rfidCardQueue, &cardIdString, 0);
            if (strcmp(cardIdString, prevCardIdString) == 0) {
              Serial.println("Same Card ...");
              if (playProperties.pausePlay)
              {
                trackControlToQueueSender(PAUSEPLAY);
                Serial.println("...continue");
              }
            } else {
              Serial.print("New Card ...");
              prevCardIdString = (char *) malloc(cardIdSize*3 +1);
              strcpy ( prevCardIdString, cardIdString );
              xQueueSend(rfidCardQueue, &cardIdString, 0);
            }

            while(true){
                esp_task_wdt_reset();
                vTaskDelay(10);
                control=0;
                for(int i=0; i<3; i++){
                    if(!mfrc522->PICC_IsNewCardPresent()){
                        if(mfrc522->PICC_ReadCardSerial()){
                        //Serial.print('a');
                        control |= 0x16;
                        }
                        if(mfrc522->PICC_ReadCardSerial()){
                        //Serial.print('b');
                        control |= 0x16;
                        }
                        //Serial.print('c');
                        control += 0x1;
                    }
                //Serial.print('d');
                control += 0x4;
                }
                
                //Serial.println(control);
                if(control == 13 || control == 14){
                  //card is still there
                } else {
                  break;
                }
            }
            Serial.println("CardRemoved");
            if (!playProperties.pausePlay)
            {
              trackControlToQueueSender(PAUSEPLAY);
              Serial.println("...continue");
            }
            mfrc522->PICC_HaltA();
            mfrc522->PCD_StopCrypto1();
        }
    }
    vTaskDelete(NULL);
}
#endif



#ifdef RFID_READER_TYPE_PN5180
// Instructs RFID-scanner to scan for new RFID-tags using PN5180
void rfidScanner(void *parameter) {
    static PN5180ISO14443 nfc14443(RFID_CS, RFID_BUSY, RFID_RST);
    static PN5180ISO15693 nfc15693(RFID_CS, RFID_BUSY, RFID_RST);
    nfc14443.begin();
    nfc14443.reset();
    // show PN5180 reader version
    uint8_t firmwareVersion[2];
    nfc14443.readEEprom(FIRMWARE_VERSION, firmwareVersion, sizeof(firmwareVersion));
    Serial.print(F("Firmware version="));
    Serial.print(firmwareVersion[1]);
    Serial.print(".");
    Serial.println(firmwareVersion[0]);

    // activate RF field
    delay(4);
    loggerNl(serialDebug, (char *) FPSTR(rfidScannerReady), LOGLEVEL_DEBUG);
    byte cardId[cardIdSize], lastCardId[cardIdSize];
    char *cardIdString;

    for (;;) {
        esp_task_wdt_reset();
        if (sleeping)
          break;
        vTaskDelay(10);
        if ((millis() - lastRfidCheckTimestamp) >= RFID_SCAN_INTERVAL) {
            // Reset the loop if no new card is present on the sensor/reader. This saves the entire process when idle.
            lastRfidCheckTimestamp = millis();
            // 1. check for an ISO-14443 card
            nfc14443.reset();
            nfc14443.setupRF();
            uint8_t uid[10];
            if (nfc14443.isCardPresent() && nfc14443.readCardSerial(uid)) {
                cardIdString = (char *) malloc(cardIdSize*3 +1);
                if (cardIdString == NULL) {
                    logger(serialDebug, (char *) FPSTR(unableToAllocateMem), LOGLEVEL_ERROR);
                    #ifdef NEOPIXEL_ENABLE
                        showLedError = true;
                    #endif
                    continue;
                }
                for (uint8_t i=0; i<cardIdSize; i++)
                    cardId[i] = uid[i];
                // check for different card id
                if ( memcmp( (const void *)cardId, (const void *)lastCardId, sizeof(cardId)) == 0)
                    continue;
                memcpy(lastCardId, cardId, sizeof(cardId));
                uint8_t n = 0;
                logger(serialDebug, (char *) FPSTR(rfidTagDetected), LOGLEVEL_NOTICE);
                for (uint8_t i=0; i<cardIdSize; i++) {
                    snprintf(logBuf, serialLoglength, "%02x", cardId[i]);
                    logger(serialDebug, logBuf, LOGLEVEL_NOTICE);

                    n += snprintf (&cardIdString[n], sizeof(cardIdString) / sizeof(cardIdString[0]), "%03d", cardId[i]);
                    if (i<(cardIdSize-1)) {
                        logger(serialDebug, "-", LOGLEVEL_NOTICE);
                    } else {
                        logger(serialDebug, "\n", LOGLEVEL_NOTICE);
                    }
                }
                xQueueSend(rfidCardQueue, &cardIdString, 0);
                continue;
            }
            // 2. check for an ISO-15693 card
            nfc15693.reset();
            nfc15693.setupRF();
            // check for ICODE-SLIX2 password protected tag
            // put your privacy password here, e.g.:
            // https://de.ifixit.com/Antworten/Ansehen/513422/nfc+Chips+f%C3%BCr+tonies+kaufen
            uint8_t password[] = {0x01, 0x02, 0x03, 0x04};
            ISO15693ErrorCode myrc = nfc15693.disablePrivacyMode(password);
            if (ISO15693_EC_OK == myrc) {
                Serial.println(F("disabling privacy-mode successful"));
            }
            // try to read ISO15693 inventory
            ISO15693ErrorCode rc = nfc15693.getInventory(uid);
            if (rc == ISO15693_EC_OK) {
                cardIdString = (char *) malloc(cardIdSize*3 +1);
                if (cardIdString == NULL) {
                    logger(serialDebug, (char *) FPSTR(unableToAllocateMem), LOGLEVEL_ERROR);
                    #ifdef NEOPIXEL_ENABLE
                        showLedError = true;
                    #endif
                    continue;
                }
                for (uint8_t i=0; i<cardIdSize; i++)
                    cardId[i] = uid[i];
                // check for different card id
                if ( memcmp( (const void *)cardId, (const void *)lastCardId, sizeof(cardId)) == 0)
                    continue;
                memcpy(lastCardId, cardId, sizeof(cardId));

                uint8_t n = 0;
                logger(serialDebug, (char *) FPSTR(rfid15693TagDetected), LOGLEVEL_NOTICE);
                for (uint8_t i=0; i<cardIdSize; i++) {
                    snprintf(logBuf, serialLoglength, "%02x", cardId[i]);
                    logger(serialDebug, logBuf, LOGLEVEL_NOTICE);

                    n += snprintf (&cardIdString[n], sizeof(cardIdString) / sizeof(cardIdString[0]), "%03d", cardId[i]);
                    if (i<(cardIdSize-1)) {
                        logger(serialDebug, "-", LOGLEVEL_NOTICE);
                    } else {
                        logger(serialDebug, "\n", LOGLEVEL_NOTICE);
                    }
                }
                xQueueSend(rfidCardQueue, &cardIdString, 0);
            }
        }
    }
    //Serial.println("deleted RFID scanner-task");
    vTaskDelete(NULL);
}
#endif

// This task handles everything for Neopixel-visualisation
#ifdef NEOPIXEL_ENABLE


// Switches Neopixel-addressing from clockwise to counter clockwise (and vice versa)
uint8_t ledAddress(uint8_t number) {
    #ifdef NEOPIXEL_REVERSE_ROTATION
        return NUM_LEDS-1-number;
    #else
        return number;
    #endif
}


void showLed(void *parameter) {
    static uint8_t hlastVolume = currentVolume;
    static uint8_t lastPos = playProperties.currentRelPos;
    static bool lastPlayState = false;
    static bool lastLockState = false;
    static bool ledBusyShown = false;
    static bool notificationShown = false;
    static bool volumeChangeShown = false;
    static bool showEvenError = false;
    static uint8_t ledPosWebstream = 0;
    static uint8_t ledSwitchInterval = 5; // time in secs (webstream-only)
    static uint8_t webstreamColor = 0;
    static unsigned long lastSwitchTimestamp = 0;
    static bool redrawProgress = false;
    static uint8_t lastLedBrightness = ledBrightness;

