elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
            if (processJsonRequest((char*)data)) {
                sendWebsocketData(client->id(), 1);
            }

            if (info->opcode == WS_TEXT) {
                data[len] = 0;
                Serial.printf("%s\n", (char*)data);
            } else {
                for (size_t i=0; i < info->len; i++){
                    Serial.printf("%02x ", data[i]);
                }
                Serial.printf("\n");
            }
        }
    }
}

// Set maxVolume depending on headphone-adjustment is enabled and headphone is/is not connected
void setupVolume(void) {

    #ifndef HEADPHONE_ADJUST_ENABLE
        maxVolume = maxVolumeSpeaker;
        return;
    #else
        if (digitalRead(HP_DETECT)) {
            maxVolume = maxVolumeSpeaker;               // 1 if headphone is not connected
        } else {
            maxVolume = maxVolumeHeadphone;             // 0 if headphone is connected (put to GND)
        }
        snprintf(logBuf, serialLoglength, "%s: %u", (char *) FPSTR(maxVolumeSet), maxVolume);
        loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        return;
    #endif
}


#ifdef HEADPHONE_ADJUST_ENABLE
    void headphoneVolumeManager(void) {
        bool currentHeadPhoneDetectionState = digitalRead(HP_DETECT);

        if (headphoneLastDetectionState != currentHeadPhoneDetectionState && (millis() - headphoneLastDetectionTimestamp >= headphoneLastDetectionDebounce)) {
            if (currentHeadPhoneDetectionState) {
                maxVolume = maxVolumeSpeaker;
            } else {
                maxVolume = maxVolumeHeadphone;
                if (currentVolume > maxVolume) {
                    volumeToQueueSender(maxVolume);         // Lower volume for headphone if headphone's maxvolume is exceeded by volume set in speaker-mode
                }
            }
            headphoneLastDetectionState = currentHeadPhoneDetectionState;
            headphoneLastDetectionTimestamp = millis();
            snprintf(logBuf, serialLoglength, "%s: %u", (char *) FPSTR(maxVolumeSet), maxVolume);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        }
    }
#endif


bool isNumber(const char *str) {
  byte i = 0;

  while (*(str + i) != '\0') {
    if (!isdigit(*(str + i++))) {
      return false;
    }
  }

  if (i>0) {
      return true;
  } else {
      return false;
  }

}


void webserverStart(void) {
    if (wifiManager() == WL_CONNECTED && !webserverStarted) {
    // attach AsyncWebSocket for Mgmt-Interface
    ws.onEvent(onWebsocketEvent);
    wServer.addHandler(&ws);

    // attach AsyncEventSource
    wServer.addHandler(&events);

    // Default
    wServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send_P(200, "text/html", management_HTML, templateProcessor);
    });

    // NVS-backup-upload
    wServer.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request){
            request->send_P(200, "text/html", backupRecoveryWebsite);
    }, handleUpload);

    // ESP-restart
    wServer.on("/restart", HTTP_GET, [] (AsyncWebServerRequest *request) {
        request->send_P(200, "text/html", restartWebsite);
        Serial.flush();
        ESP.restart();
    });

    // Fileexplorer (realtime)
    wServer.on("/explorer", HTTP_GET, explorerHandleListRequest);

    wServer.on("/explorer", HTTP_POST, [](AsyncWebServerRequest *request) {
        request->send(200);
    }, explorerHandleFileUpload);

    wServer.on("/explorer", HTTP_DELETE, explorerHandleDeleteRequest);

    wServer.on("/explorer", HTTP_PUT, explorerHandleCreateRequest);

    wServer.on("/explorer", HTTP_PATCH, explorerHandleRenameRequest);

    wServer.on("/exploreraudio", HTTP_POST, explorerHandleAudioRequest);

    wServer.onNotFound(notFound);

    // allow cors for local debug
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
    wServer.begin();
    webserverStarted = true;
    }
}

//get Webradio Stations
    bool getWebRadioStations(char *_namespace) {
        #ifdef NEOPIXEL_ENABLE
            pauseNeopixel = true;   // Workaround to prevent exceptions due to Neopixel-signalisation while NVS-write
        #endif
        esp_partition_iterator_t pi;                // Iterator for find
        const esp_partition_t* nvs;                 // Pointer to partition struct
        esp_err_t result = ESP_OK;
        const char* partname = "nvs";
        uint8_t pagenr = 0;                         // Page number in NVS
        uint8_t i;                                  // Index in Entry 0..125
        uint8_t bm;                                 // Bitmap for an entry
        uint32_t offset = 0;                        // Offset in nvs partition
        uint8_t namespace_ID;                       // Namespace ID found
        char* station = (char *) malloc(sizeof(char) * 255);

         pi = esp_partition_find ( ESP_PARTITION_TYPE_DATA,          // Get partition iterator for
                                    ESP_PARTITION_SUBTYPE_ANY,      // this partition
                                    partname ) ;

         if (pi) {
            nvs = esp_partition_get(pi);                            // Get partition struct
            esp_partition_iterator_release(pi);                     // Release the iterator
            dbgprint ( "Partition %s found, %d bytes",
                    partname,
                    nvs->size ) ;
        } else {
            Serial.printf("Partition %s not found!", partname) ;
            return NULL;
        }

        namespace_ID = FindNsID (nvs, _namespace) ;             // Find ID of our namespace in NVS

        while (offset < nvs->size) {
            result = esp_partition_read (nvs, offset,                // Read 1 page in nvs partition
                                        &buf,
                                        sizeof(nvs_page));
            if (result != ESP_OK) {
                Serial.println(F("Error reading NVS!"));
                return false;
            }

            i = 0;

            while (i < 126) {
                bm = (buf.Bitmap[i/4] >> ((i % 4) * 2 )) & 0x03;  // Get bitmap for this entry
                if (bm == 2) {
                    if ((namespace_ID == 0xFF) ||                      // Show all if ID = 0xFF
                        (buf.Entry[i].Ns == namespace_ID)) {           // otherwise just my namespace
                        if (isNumber(buf.Entry[i].Key)) {
                            String s = prefsRfid.getString((const char *)buf.Entry[i].Key);
                            Serial.printf("%s%s\n", buf.Entry[i].Key, s.c_str());
                            webradiostations.push_back(s.c_str());
                        }
                    }
                    i += buf.Entry[i].Span;                              // Next entry
                } else {
                    i++;
                }
            }
            offset += sizeof(nvs_page);                              // Prepare to read next page in nvs
            
            pagenr++;
            
