elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
        }

        for (int i = 0; i < webradiostations.size(); i++) {
            Serial.printf("%s\n", webradiostations[i].c_str());
        }

        #ifdef NEOPIXEL_ENABLE
            pauseNeopixel = false;
        #endif

        return true;
    }


// Dumps all RFID-entries from NVS into a file on SD-card
    bool dumpNvsToSd(char *_namespace, char *_destFile) {
        #ifdef NEOPIXEL_ENABLE
            pauseNeopixel = true;   // Workaround to prevent exceptions due to Neopixel-signalisation while NVS-write
        #endif
        esp_partition_iterator_t pi;                // Iterator for find
        const esp_partition_t* nvs;                 // Pointer to partition struct
        esp_err_t result = ESP_OK;
        const char* partname = "nvs";
        uint8_t pagenr = 0;                         // Page number in NVS
        uint8_t i;                                  // Index in Entry 0..125
        uint8_t bm;                                 // Bitmap for an entry
        uint32_t offset = 0;                        // Offset in nvs partition
        uint8_t namespace_ID;                       // Namespace ID found

        pi = esp_partition_find ( ESP_PARTITION_TYPE_DATA,          // Get partition iterator for
                                    ESP_PARTITION_SUBTYPE_ANY,      // this partition
                                    partname ) ;
        if (pi) {
            nvs = esp_partition_get(pi);                            // Get partition struct
            esp_partition_iterator_release(pi);                     // Release the iterator
            dbgprint ( "Partition %s found, %d bytes",
                    partname,
                    nvs->size ) ;
        } else {
            snprintf(logBuf, serialLoglength, "Partition %s not found!", partname);
            loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
            return NULL;
        }
        namespace_ID = FindNsID (nvs, _namespace) ;             // Find ID of our namespace in NVS
        File backupFile = FSystem.open(_destFile, FILE_WRITE);
        if (!backupFile) {
            return false;
        }
        while (offset < nvs->size) {
            result = esp_partition_read (nvs, offset,                // Read 1 page in nvs partition
                                        &buf,
                                        sizeof(nvs_page));
            if (result != ESP_OK) {
                snprintf(logBuf, serialLoglength, "Error reading NVS!");
                loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
                return false;
            }

            i = 0;

            while (i < 126) {
                bm = (buf.Bitmap[i/4] >> ((i % 4) * 2 )) & 0x03;  // Get bitmap for this entry
                if (bm == 2) {
                    if ((namespace_ID == 0xFF) ||                      // Show all if ID = 0xFF
                        (buf.Entry[i].Ns == namespace_ID)) {           // otherwise just my namespace
                        if (isNumber(buf.Entry[i].Key)) {
                            String s = prefsRfid.getString((const char *)buf.Entry[i].Key);
                            backupFile.printf("%s%s%s%s\n", stringOuterDelimiter, buf.Entry[i].Key, stringOuterDelimiter, s.c_str());
                        }
                    }
                    i += buf.Entry[i].Span;                              // Next entry
                } else {
                    i++;
                }
            }
            offset += sizeof(nvs_page);                              // Prepare to read next page in nvs
            pagenr++;
        }

        backupFile.close();
        #ifdef NEOPIXEL_ENABLE
            pauseNeopixel = false;
        #endif

        return true;
    }

// Conversion routine for http UTF-8 strings
void convertUtf8ToAscii(String utf8String, char *asciiString) {
    uint16_t i = 0, j=0;
    bool f_C3_seen = false;

    while(utf8String[i] != 0) {                                     // convert UTF8 to ASCII
        if(utf8String[i] == 195){                                   // C3
            i++;
            f_C3_seen = true;
            continue;
        }
        asciiString[j] = utf8String[i];
        if(asciiString[j] > 128 && asciiString[j] < 189 && f_C3_seen == true) {
            asciiString[j] = asciiString[j] + 64;                      // found a related ASCII sign
            f_C3_seen = false;
        }
        i++; j++;
    }
    asciiString[j] = 0;

}

// Handles file upload request from the explorer
// requires a GET parameter path, as directory path to the file
void explorerHandleFileUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {

    lastTimeActiveTimestamp = millis();

    // New File
    if (!index) {
        String utf8FilePath;
        static char asciiFilePath[256];
        if (request->hasParam("path")) {
            AsyncWebParameter *param = request->getParam("path");
            utf8FilePath = param->value() + "/" + filename;

        } else {
            utf8FilePath = "/" + filename;
        }
        convertUtf8ToAscii(utf8FilePath, asciiFilePath);

        // Create Ringbuffer for upload
        if(explorerFileUploadRingBuffer == NULL) {
            explorerFileUploadRingBuffer = xRingbufferCreate(4096, RINGBUF_TYPE_BYTEBUF);
        }

        // Create Queue for receiving a signal from the store task as synchronisation
        if(explorerFileUploadStatusQueue == NULL) {
            explorerFileUploadStatusQueue = xQueueCreate(1, sizeof(uint8_t));
        }

        // Create Task for handling the storage of the data
        xTaskCreate(
            explorerHandleFileStorageTask, /* Function to implement the task */
            "fileStorageTask", /* Name of the task */
            4000,  /* Stack size in words */
            asciiFilePath,  /* Task input parameter */
            2 | portPRIVILEGE_BIT,  /* Priority of the task */
            &fileStorageTaskHandle  /* Task handle. */
        );

