elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
    }

    if (len) {
        // stream the incoming chunk to the ringbuffer
        xRingbufferSend(explorerFileUploadRingBuffer, data, len, portTICK_PERIOD_MS * 1000);
    }

    if (final) {
        // notify storage task that last data was stored on the ring buffer
        xTaskNotify(fileStorageTaskHandle, 1u, eNoAction);
        // watit until the storage task is sending the signal to finish
        uint8_t signal;
        xQueueReceive(explorerFileUploadStatusQueue, &signal, portMAX_DELAY);

        // delete task
        vTaskDelete(fileStorageTaskHandle);
    }
}

void explorerHandleFileStorageTask(void *parameter) {

    File uploadFile;
    size_t item_size;
    uint8_t *item;
    uint8_t value = 0;

    BaseType_t uploadFileNotification;
    uint32_t uploadFileNotificationValue;

    uploadFile = FSystem.open((char *)parameter, "w");

    snprintf(logBuf, serialLoglength, "%s: %s", (char *) FPSTR(writingFile), (char *) parameter);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);

    for(;;) {
        esp_task_wdt_reset();

        item = (uint8_t *)xRingbufferReceive(explorerFileUploadRingBuffer, &item_size, portTICK_PERIOD_MS * 100);
        if (item != NULL) {
            uploadFile.write(item, item_size);
            vRingbufferReturnItem(explorerFileUploadRingBuffer, (void *)item);
        } else {
            // No data in the buffer, check if all data arrived for the file
            uploadFileNotification = xTaskNotifyWait(0,0,&uploadFileNotificationValue,0);
            if(uploadFileNotification == pdPASS) {
                uploadFile.close();
                // done exit loop to terminate
                break;
            }
            vTaskDelay(portTICK_PERIOD_MS * 100);
        }
    }
    // send signal to upload function to terminate
    xQueueSend(explorerFileUploadStatusQueue, &value, 0);
    vTaskDelete(NULL);
}

// Sends a list of the content of a directory as JSON file
// requires a GET parameter path for the directory
void explorerHandleListRequest(AsyncWebServerRequest *request) {
    DynamicJsonDocument jsonBuffer(16384);
    //StaticJsonDocument<4096> jsonBuffer;
    String serializedJsonString;
    AsyncWebParameter *param;
    char asciiFilePath[256];
    JsonArray obj = jsonBuffer.createNestedArray();
    File root;
    if(request->hasParam("path")){
        param = request->getParam("path");
        convertUtf8ToAscii(param->value(), asciiFilePath);
        root = FSystem.open(asciiFilePath);
    } else {
        root = FSystem.open("/");
    }

    if (!root) {
        snprintf(logBuf, serialLoglength, (char *) FPSTR(failedToOpenDirectory));
        loggerNl(serialDebug, logBuf, LOGLEVEL_DEBUG);
        return;
    }

    if (!root.isDirectory()) {
        snprintf(logBuf, serialLoglength, (char *) FPSTR(notADirectory));
        loggerNl(serialDebug, logBuf, LOGLEVEL_DEBUG);
        return;
    }

    File file = root.openNextFile();

    while(file) {
        JsonObject entry = obj.createNestedObject();
        std::string path = file.name();
        std::string fileName = path.substr(path.find_last_of("/") + 1);

        entry["name"] = fileName;
        entry["dir"].set(file.isDirectory());

        file = root.openNextFile();

        esp_task_wdt_reset();

    }

    serializeJson(obj, serializedJsonString);
    request->send(200, "application/json; charset=iso-8859-1", serializedJsonString);
}

bool explorerDeleteDirectory(File dir) {

    File file = dir.openNextFile();
    while(file) {

        if(file.isDirectory()) {
            explorerDeleteDirectory(file);
        } else {
            FSystem.remove(file.name());
        }

        file = dir.openNextFile();

        esp_task_wdt_reset();
    }

    return FSystem.rmdir(dir.name());

}

// Handles delete request of a file or directory
// requires a GET parameter path to the file or directory
void explorerHandleDeleteRequest(AsyncWebServerRequest *request) {
    File file;
    AsyncWebParameter *param;
    char asciiFilePath[256];
    if(request->hasParam("path")){
        param = request->getParam("path");
        convertUtf8ToAscii(param->value(), asciiFilePath);
        if(FSystem.exists(asciiFilePath)) {
            file = FSystem.open(asciiFilePath);
            if(file.isDirectory()) {
                if(explorerDeleteDirectory(file)) {
                    snprintf(logBuf, serialLoglength, "DELETE:  %s deleted", asciiFilePath);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
                } else {
                    snprintf(logBuf, serialLoglength, "DELETE:  Cannot delete %s", asciiFilePath);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
                }
            } else {
                if(FSystem.remove(asciiFilePath)) {
                    snprintf(logBuf, serialLoglength, "DELETE:  %s deleted", asciiFilePath);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
                } else {
                    snprintf(logBuf, serialLoglength, "DELETE:  Cannot delete %s", asciiFilePath);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
                }
            }
        } else {
            snprintf(logBuf, serialLoglength, "DELETE: Path %s does not exist", asciiFilePath);
            loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
        }
    } else {
        loggerNl(serialDebug, "DELETE: No path variable set", LOGLEVEL_ERROR);
    }
    request->send(200);
    esp_task_wdt_reset();
}

// Handles create request of a directory
// requires a GET parameter path to the new directory
void explorerHandleCreateRequest(AsyncWebServerRequest *request) {
    AsyncWebParameter *param;
    char asciiFilePath[256];
    if(request->hasParam("path")){
        param = request->getParam("path");
        convertUtf8ToAscii(param->value(), asciiFilePath);
        if(FSystem.mkdir(asciiFilePath)) {
            snprintf(logBuf, serialLoglength, "CREATE:  %s created", asciiFilePath);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        } else {
            snprintf(logBuf, serialLoglength, "CREATE:  Cannot create %s", asciiFilePath);
            loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
        }
    } else {
        loggerNl(serialDebug, "CREATE: No path variable set", LOGLEVEL_ERROR);
    }
    request->send(200);
}

// Handles rename request of a file or directory
// requires a GET parameter srcpath to the old file or directory name
// requires a GET parameter dstpath to the new file or directory name
void explorerHandleRenameRequest(AsyncWebServerRequest *request) {
    AsyncWebParameter *srcPath;
    AsyncWebParameter *dstPath;
    char srcFullFilePath[256];
    char dstFullFilePath[256];
    if(request->hasParam("srcpath") && request->hasParam("dstpath")) {
        srcPath = request->getParam("srcpath");
        dstPath = request->getParam("dstpath");
        convertUtf8ToAscii(srcPath->value(), srcFullFilePath);
        convertUtf8ToAscii(dstPath->value(), dstFullFilePath);
        if(FSystem.exists(srcFullFilePath)) {
            if(FSystem.rename(srcFullFilePath, dstFullFilePath)) {
                    snprintf(logBuf, serialLoglength, "RENAME:  %s renamed to %s", srcFullFilePath, dstFullFilePath);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
            } else {
                    snprintf(logBuf, serialLoglength, "RENAME:  Cannot rename %s", srcFullFilePath);
                    loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
            }
        } else {
            snprintf(logBuf, serialLoglength, "RENAME: Path %s does not exist", srcFullFilePath);
            loggerNl(serialDebug, logBuf, LOGLEVEL_ERROR);
        }
    } else {
        loggerNl(serialDebug, "RENAME: No path variable set", LOGLEVEL_ERROR);
    }

