elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
    // Get MQTT-server from NVS
    String nvsMqttServer = prefsSettings.getString("mqttServer", "-1");
    if (!nvsMqttServer.compareTo("-1")) {
        prefsSettings.putString("mqttServer", (String) mqtt_server);
        loggerNl(serialDebug, (char*) FPSTR(wroteMqttServerToNvs), LOGLEVEL_ERROR);
    } else {
        strncpy(mqtt_server, nvsMqttServer.c_str(), mqttServerLength);
        snprintf(logBuf, serialLoglength, "%s: %s", (char *) FPSTR(restoredMqttServerFromNvs), nvsMqttServer.c_str());
        loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
    }

    // Get MQTT-user from NVS
    String nvsMqttUser = prefsSettings.getString("mqttUser", "-1");
    if (!nvsMqttUser.compareTo("-1")) {
        prefsSettings.putString("mqttUser", (String) mqttUser);
        loggerNl(serialDebug, (char *) FPSTR(wroteMqttUserToNvs), LOGLEVEL_ERROR);
    } else {
        strncpy(mqttUser, nvsMqttUser.c_str(), mqttUserLength);
        snprintf(logBuf, serialLoglength, "%s: %s", (char *) FPSTR(restoredMqttUserFromNvs), nvsMqttUser.c_str());
        loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
    }

    // Get MQTT-password from NVS
    String nvsMqttPassword = prefsSettings.getString("mqttPassword", "-1");
    if (!nvsMqttPassword.compareTo("-1")) {
        prefsSettings.putString("mqttPassword", (String) mqttPassword);
        loggerNl(serialDebug, (char *) FPSTR(wroteMqttPwdToNvs), LOGLEVEL_ERROR);
    } else {
        strncpy(mqttPassword, nvsMqttPassword.c_str(), mqttPasswordLength);
        snprintf(logBuf, serialLoglength, "%s: %s", (char *) FPSTR(restoredMqttPwdFromNvs), nvsMqttPassword.c_str());
        loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
    }

    #ifdef MEASURE_BATTERY_VOLTAGE
        // Get voltages from NVS for Neopixel
        float vLowIndicator = prefsSettings.getFloat("vIndicatorLow", 999.99);
        if (vLowIndicator <= 999) {
            voltageIndicatorLow = vLowIndicator;
            snprintf(logBuf, serialLoglength, "%s: %.2f V", (char *) FPSTR(voltageIndicatorLowFromNVS), vLowIndicator);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        } else {    // preseed if not set
            prefsSettings.putFloat("vIndicatorLow", voltageIndicatorLow);
        }

        float vHighIndicator = prefsSettings.getFloat("vIndicatorHigh", 999.99);
        if (vHighIndicator <= 999) {
            voltageIndicatorHigh = vHighIndicator;
            snprintf(logBuf, serialLoglength, "%s: %.2f V", (char *) FPSTR(voltageIndicatorHighFromNVS), vHighIndicator);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        } else {
            prefsSettings.putFloat("vIndicatorHigh", voltageIndicatorHigh);
        }

        float vLowWarning = prefsSettings.getFloat("wLowVoltage", 999.99);
        if (vLowWarning <= 999) {
            warningLowVoltage = vLowWarning;
            snprintf(logBuf, serialLoglength, "%s: %.2f V", (char *) FPSTR(warningLowVoltageFromNVS), vLowWarning);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        } else {
            prefsSettings.putFloat("wLowVoltage", warningLowVoltage);
        }

        uint32_t vInterval = prefsSettings.getUInt("vCheckIntv", 17777);
        if (vInterval != 17777) {
            voltageCheckInterval = vInterval;
            snprintf(logBuf, serialLoglength, "%s: %u Minuten", (char *) FPSTR(voltageCheckIntervalFromNVS), vInterval);
            loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
        } else {
            prefsSettings.putUInt("vCheckIntv", voltageCheckInterval);
        }
    #endif

    // Create queues
    volumeQueue = xQueueCreate(1, sizeof(int));
    if (volumeQueue == NULL) {
        loggerNl(serialDebug, (char *) FPSTR(unableToCreateVolQ), LOGLEVEL_ERROR);
    }

    rfidCardQueue = xQueueCreate(1, (cardIdSize + 1) * sizeof(char));
    if (rfidCardQueue == NULL) {
        loggerNl(serialDebug, (char *) FPSTR(unableToCreateRfidQ), LOGLEVEL_ERROR);
    }

    trackControlQueue = xQueueCreate(1, sizeof(uint8_t));
    if (trackControlQueue == NULL) {
        loggerNl(serialDebug, (char *) FPSTR(unableToCreateMgmtQ), LOGLEVEL_ERROR);
    }

    char **playlistArray;
    trackQueue = xQueueCreate(1, sizeof(playlistArray));
    if (trackQueue == NULL) {
        loggerNl(serialDebug, (char *) FPSTR(unableToCreatePlayQ), LOGLEVEL_ERROR);
    }

    // Create 1000Hz-HW-Timer (currently only used for buttons)
    timerSemaphore = xSemaphoreCreateBinary();
    timer = timerBegin(0, 240, true);           // Prescaler: CPU-clock in MHz
    timerAttachInterrupt(timer, &onTimer, true);
    timerAlarmWrite(timer, 1000, true);         // 1000 Hz
    timerAlarmEnable(timer);

    #ifdef BLUETOOTH_ENABLE
        if (operating_mode == BT_MODE) {
            
            i2s_pin_config_t pin_config = {
                .bck_io_num = I2S_BCLK,
                .ws_io_num = I2S_LRC,
                .data_out_num = I2S_DOUT,
                .data_in_num = I2S_PIN_NO_CHANGE
            };

            a2dp_sink.set_pin_config(pin_config);
            a2dp_sink.start("ESPuino");

            #ifdef NEOPIXEL_ENABLE
                showLedBT = true;
            #endif
            
        }        
    #endif

    // Create tasks
    if (operating_mode != BT_MODE) {
        xTaskCreatePinnedToCore(
            rfidScanner, /* Function to implement the task */
            "rfidhandling", /* Name of the task */
            2000,  /* Stack size in words */
            NULL,  /* Task input parameter */
            1,  /* Priority of the task */
            &rfid,  /* Task handle. */
            0 /* Core where the task should run */
        );
    }

    if (operating_mode == ESPUINO_MODE) {
        xTaskCreatePinnedToCore(
            playAudio, /* Function to implement the task */
            "mp3play", /* Name of the task */
            11000,  /* Stack size in words */
            NULL,  /* Task input parameter */
            2 | portPRIVILEGE_BIT,  /* Priority of the task */
            &mp3Play,  /* Task handle. */
            1 /* Core where the task should run */
        );
    }


