elmar-ops/Tonuino-ESP32-I2S/src/main.cpp
    // Activate internal pullups for all buttons
    pinMode(DREHENCODER_BUTTON, INPUT_PULLUP);
    pinMode(PAUSEPLAY_BUTTON, INPUT_PULLUP);
    pinMode(NEXT_BUTTON, INPUT_PULLUP);
    pinMode(PREVIOUS_BUTTON, INPUT_PULLUP);

    #ifdef USE_ENCODER
        // Init rotary encoder
        encoder.attachHalfQuad(DREHENCODER_CLK, DREHENCODER_DT);
        encoder.clearCount();
        encoder.setCount(initVolume*2);         // Ganzes Raster ist immer +2, daher initiale Lautstärke mit 2 multiplizieren
    #endif

    // Only enable MQTT if requested
    #ifdef MQTT_ENABLE
        if (enableMqtt) {
            MQTTclient.setServer(mqtt_server, 1883);
            MQTTclient.setCallback(callback);
        }
    #endif

    esp_sleep_enable_ext1_wakeup(WAKUPMASK, ESP_EXT1_WAKEUP_ALL_LOW);
    
    if (operating_mode != BT_MODE) {
      wifiEnabled = getWifiEnableStatusFromNVS();
      wifiManager();
    }

    lastTimeActiveTimestamp = millis();     // initial set after boot

    bootComplete = true;

    if (operating_mode != BT_MODE) {
        Serial.printf("\n****Before BLEDevice::deinit ESP.getFreeHeap() %u\n",ESP.getFreeHeap());
        esp_bt_controller_deinit();
        esp_bt_mem_release(ESP_BT_MODE_BTDM);
        Serial.printf("\n****After BLEDevice::deinit ESP.getFreeHeap() %u\n",ESP.getFreeHeap());
    }

    if (operating_mode == WEBRADIO_MODE) {
        getWebRadioStations("rfidTags");
    }

    snprintf(logBuf, serialLoglength, "%s: %u", (char *) FPSTR(freeHeapAfterSetup), ESP.getFreeHeap());
    loggerNl(serialDebug, logBuf, LOGLEVEL_DEBUG);
    Serial.printf("PSRAM: %u bytes\n", ESP.getPsramSize());
    playAudioMenu((char *) FPSTR(welcome));
}


void loop() {
    if (operating_mode != BT_MODE) {
      webserverStart();
    }

    if (operating_mode == BT_MODE) {
       lastTimeActiveTimestamp = millis(); //prevent sleep
    }

	#ifdef FTP_ENABLE
        ftpManager();
    #endif
    
    #ifdef HEADPHONE_ADJUST_ENABLE
        headphoneVolumeManager();
    #endif
    #ifdef MEASURE_BATTERY_VOLTAGE
        batteryVoltageTester();
    #endif
    #ifdef USE_ENCODER
        volumeHandler(minVolume, maxVolume);
    #endif
    buttonHandler();
    doButtonActions();
    sleepHandler();
    deepSleepManager();
    rfidPreferenceLookupHandler();
    if (wifiManager() == WL_CONNECTED) {
        #ifdef MQTT_ENABLE
            if (enableMqtt) {
                reconnect();
                MQTTclient.loop();
                postHeartbeatViaMqtt();
            }
        #endif
        #ifdef FTP_ENABLE
            if (ftpEnableLastStatus && ftpEnableCurrentStatus) {
                ftpSrv->handleFTP();
            }
        #endif
    }
    #ifdef FTP_ENABLE
        if (ftpEnableLastStatus && ftpEnableCurrentStatus) {
            if (ftpSrv->isConnected()) {
                lastTimeActiveTimestamp = millis();     // Re-adjust timer while client is connected to avoid ESP falling asleep
            }
        }
    #endif

    #ifdef PLAY_LAST_RFID_AFTER_REBOOT
        if (operating_mode != BT_MODE) {
          recoverLastRfidPlayed();
        }
    #endif

    ws.cleanupClients();
}


// Some mp3-lib-stuff (slightly changed from default)
void audio_info(const char *info) {
    snprintf(logBuf, serialLoglength, "info        : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}
void audio_id3data(const char *info) {  //id3 metadata
    snprintf(logBuf, serialLoglength, "id3data     : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}
void audio_eof_mp3(const char *info) {  //end of file
    snprintf(logBuf, serialLoglength, "eof_mp3     : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
    playProperties.trackFinished = true;
}
void audio_showstation(const char *info) {
    snprintf(logBuf, serialLoglength, "station     : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_NOTICE);
    char buf[255];
    snprintf(buf, sizeof(buf)/sizeof(buf[0]), "Webradio: %s", info);
    #ifdef MQTT_ENABLE
        publishMqtt((char *) FPSTR(topicTrackState), buf, false);
    #endif
}
void audio_showstreamtitle(const char *info) {
    snprintf(logBuf, serialLoglength, "streamtitle : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}
void audio_bitrate(const char *info) {
    snprintf(logBuf, serialLoglength, "bitrate     : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}
void audio_commercial(const char *info) {  //duration in sec
    snprintf(logBuf, serialLoglength, "commercial  : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}
void audio_icyurl(const char *info) {  //homepage
    snprintf(logBuf, serialLoglength, "icyurl      : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}
void audio_lasthost(const char *info) {  //stream URL played
    snprintf(logBuf, serialLoglength, "lasthost    : %s", info);
    loggerNl(serialDebug, logBuf, LOGLEVEL_INFO);
}